---
kind: method
id: M:Autodesk.Revit.DB.TessellatedShapeBuilder.#ctor
source: html/2018769c-6575-1926-7978-539291b3ff8b.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.#ctor Method

Constructs a new instance of a TessellatedShapeBuilder.

## Syntax (C#)
```csharp
public TessellatedShapeBuilder()
```